Revit 2026 API

# GenericZoneArea Property

---

The area for the zone, in square feet.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Area { get; }
```
```vb
Public ReadOnly Property Area As Double
	Get
```
```cpp
public:
property double Area {
	double get ();
}
```
```fsharp
member Area : float with get
```

#### Property Value

Double

The area (the gross area) of a space-based zone is the sum of the areas of all spaces in the zone.

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace